In [2]:
import numpy as np
import pandas as pd

In [20]:
data ={'Company':['GOOG','GOOG','MSTF','MSTF','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Zones'],
        'Sales':[200,120,340,123,209,900]
      }

In [22]:
df = pd.DataFrame(data)

In [24]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSTF      Amy    340
3    MSTF  Vanessa    123
4      FB     Carl    209
5      FB    Zones    900

In [30]:
byComp=df.groupby('Company')

In [36]:
byComp.sum()

             Person  Sales
Company
FB        CarlZones   1109
GOOG     SamCharlie    320
MSTF     AmyVanessa    463

In [42]:
byComp.sum().loc['FB']

Person    CarlZones
Sales          1109
Name: FB, dtype: object